app/controllers/messages_controller.rb

    def create
        message = current_user.messages.build(body: params[:body])
        if message.save
---
INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "This is a test message"], ["user_id", 2], ["created_at", "2023-05-10 08:29:26.756167"], ["updated_at", "2023-05-10 08:29:26.756167"]]